Repository: ShubhamBhut/picard-docs
Catalog: _locale/*/LC_MESSAGES/functions/list_by_type.po
Languages: fr

source: :index:`Scripting Functions <scripting; functions>`
fr: :index:`Fonctions de script <fonctions de script>`

source: The following is a list of the Picard scripting functions grouped by function type.
fr: Voici une liste des fonctions de script Picard regroupées par type de fonction.

source: :index:`Assignment Functions <scripting functions; assignment>`
fr: :index:`Fonctions d'affectation <fonctions de script; affectation>`

source: These functions are used to assign (or unassign) a value to a tag or variable. The assignment scripting functions are:
fr: Ces fonctions sont utilisées pour affecter (ou annuler l'attribution) d'une valeur à une balise ou une variable. Les fonctions de script d'affectation sont:

source: :index:`Text Functions <scripting functions; text>`
fr: :index:`Fonctions de texte <fonctions de script; texte>`

source: These functions are used to manage text (e.g.: extract, replace or format) in tags or variables. The text scripting functions are:
fr: Ces fonctions permettent de gérer du texte (ex: extraire, remplacer ou formater) dans des balises ou des variables. Les fonctions de script de texte sont:

source: :index:`Multi-Value Functions <scripting functions; multi-value>`
fr: :index:`Fonctions à valeurs multiples <fonctions de script; multi-valeur>`

source: These functions are used to manage multi-value tags or variables. The multi-value scripting functions are:
fr: Ces fonctions permettent de gérer des balises ou des variables à valeurs multiples. Les fonctions de script à valeurs multiples sont:

source: :index:`Mathematical Functions <scripting functions; mathematical>`
fr: :index:`Fonctions mathématiques <fonctions de script; mathématique>`

source: These functions are used to perform arithmetic operations on tags or variables. The mathematical scripting functions are:
fr: Ces fonctions sont utilisées pour effectuer des opérations arithmétiques sur des balises ou des variables. Les fonctions de script mathématiques sont:

source: :index:`Conditional Functions <scripting functions; conditional>`
fr: :index:`Fonctions conditionnelles <fonctions de script; conditionnel>`

source: These functions are used to test for various conditions and take appropriate actions depending on the results of the test.
fr: Ces fonctions sont utilisées pour tester diverses conditions et prendre les mesures appropriées en fonction des résultats du test.

source: Formatting the code in your scripts by adding things like spaces, tabs and newlines could affect the results of conditional tests because these characters are not ignored. For example,
fr: Le fait de formater le code de vos scripts en ajoutant des éléments tels que des espaces, des tabulations et des sauts de ligne peut affecter les résultats des tests conditionnels, car ces caractères ne sont pas ignorés. Par exemple,

source: will return "Not Empty" for ``%test1%``, but "Empty" for ``%test2%``. The different values are a result of the indentation in the formatted code.
fr: retournera "Not Empty" pour ``%test1%``, mais "Empty" pour ``%test2%``. Les différentes valeurs sont le résultat de l'indentation dans le code formaté.

source: The conditional scripting functions are:
fr: Les fonctions de scripts conditionnels sont :

source: :index:`Information Functions <scripting functions; information>`
fr: :index:`Fonctions d'information <fonctions de script; informations>`

source: These functions provide additional system or data information. The information scripting functions are:
fr: Ces fonctions fournissent des informations supplémentaires sur le système ou les données. Les fonctions de script d'informations sont:

source: :index:`Loop Functions <scripting functions; loop>`
fr: :index:`Fonctions de boucle <fonctions de script; boucle>`

source: These functions provide the ability to repeat actions based on the contents of a multi-value variable or the result of a conditional test. The loop scripting functions are:
fr: Ces fonctions offrent la possibilité de répéter des actions en fonction du contenu d'une variable à valeurs multiples ou du résultat d'un test conditionnel. Les fonctions de script de boucle sont:

source: :index:`Miscellaneous Functions <scripting functions; miscellaneous>`
fr: :index:`Fonctions diverses <fonctions de script; divers>`

source: The miscellaneous scripting functions are:
fr: Les diverses fonctions de script sont:
